{"[Mod Post] Regarding the novel coronavirus (COVID-19)": {"Topic Title": "[Mod Post] Regarding the novel coronavirus (COVID-19)", "Category": "Selling on Amazon", "Tags": [], "Author": "HDMS", "Commenters": ["Desperado_Distributi", "James_Amazon", "HAWKEYE", "mcqueen", "RedWing", "anonymous_bookseller", "jhnnsbstnbch", "1999Seller", "rms", "Northern_Cards", "poker_face", "Scifi"], "Leading Comment": "Hello Sellers,\nAmazon is concerned about the impact of the novel coronavirus (COVID-19), as seen on our Important notification regarding impacts of the Novel Coronavirus posted February 7.\nWe are seeing an increase in the number of off-topic coronavirus posts made in the forums. Please be mindful and refrain from posting about the coronavirus when it is off-topic, as per the Forum Guidelines 70.\nAdditional information: About the 2019 Novel Coronavirus (COVID-19) 603.\nBest regards,\nThe Moderators", "Other Comments": ["\n\n\n James_Amazon:\n\noff-topic coronavirus posts\n\n\nCan you please define for us what is on topic?\nIs it okay to start a thread on sanitary packing techniques?\nHow about a thread on the safe handling and buying of items at a garage sale?", "\n\n\n rms:\n\nIs it okay to start a thread on sanitary packing techniques?\n\n\nI think you would be ok with doing that.\nThere is no way that a starting a thread could be “off-topic”.\nSince it is the topic ", "Hey @James_Amazon\nI think since it is the main topic of everyone’s day to day conversation it is to be expected to a degree.\nWe hope that Amazon will keep sellers informed of any closures or changes that are going to be made because of this virus and it will  help stop the gossip and off topic conversations. Personally, I have seen too many “Warehouses are closing” and doom and gloom alarmist posts and appreciate your post but also send a tremendous amount of inventory to you and am hoping that Amazon keeps us all informed of any changes as they arise and not leave us in the dark.", "\n\n\n Northern_Cards:\n\nThere is no way that a starting a thread could be “off-topic”.\nSince it is the topic\n\n\nSo it would seem to a reasonable person.  But there are lots of off-topic posts in many threads, and they seldom get remarked upon by mods.\nIt seems odd that a mod would focus on off topic CV-19 posts and not other off-topic posts.  I was wondering if this was a roundabout way of saying “No CV-19 posts.”\nWhat I was trying to determine is if CV19 posts are permitted at all.", "\n\n\n rms:\n\nBut there are lots of off-topic posts in many threads, and they seldom get remarked upon by mods\n\n\nThat’s very true.\n\n\n\n rms:\n\nIt seems odd that a mod would focus on off topic CV-19 posts and not other off-topic posts.\n\n\nOf course I can’t speak for the mods. However, I can speak for myself as someone who spends way too much time in forum.\nI understand that CV-19 is an important subject that impacts sellers on a daily basis. However it seems that occasionally when folks get off-topic with CV-19, things tend to occasionally get ugly, very quickly. Including wildly inaccurate scientific information, as well as comments which could be perceived as racist.\nWhile the propagation of misinformation isn’t explicitly prohibited, it’s certainly not helpful and it can be dangerous. However, insulting groups of people is prohibited.\n\nProfanity, obscenities, or spiteful remarks.\nInsults of other groups or individuals.\n\nhttps://sellercentral.amazon.com/forums/faq 26\nSo like I said, I have no idea what Amazon’s thinking is. But, it’s my best guess they might want to shut things down more quickly on these posts, before things go too far off the rails.", "\n\n\n James_Amazon:\n\nPlease be mindful and refrain from posting about the coronavirus when it is off-topic\n\n\nOr when you’re posting on topic threads about it those seem to be an issue too.", "\n\n\n Northern_Cards:\n\nThere is no way that a starting a thread could be “off-topic”.\nSince it is the topic\n\n\nThats kind of what I thought when mine got locked. Seems the rules change daily in here now. Or maybe they change according to the poster.", "Thank you.  I am glad to see that Amazon is doing its part to reduce panic and the politicization of health matters.\nHaving said that, Costco appears to be limiting its traditional handouts of samples in some of its stores.\nNow THAT is a crisis.", "I think Amazon just wants us to not talk about it. Just “The Man” trying to keep us down!", "Amazon news reports claim they’ve cracked down on the price gouging. Amazon sellers who open threads to claim otherwise might draw undue controversial attention to the issue. Amazon has solved the problem, no need for discussion.\nMy thread was locked too. “Seattle Postal Worker tests positive for Coronavirus.” A little too close to the Amazon headquarters perhaps.", "\n\n\n anonymous_bookseller:\n\n“Seattle Postal Worker tests positive for Coronavirus.” A little too close to the Amazon headquarters perhaps.\n\n\nWe are long past that.\nAmazon announced on March 3rd that one of its Seattle area employees had tested positive for the virus", "\n\n\n anonymous_bookseller:\n\nMy thread was locked too. “Seattle Postal Worker tests positive for Coronavirus.” A little too close to the Amazon headquarters perhaps.\n\n\nI do not think the topics themselves get threads locked, but the wild speculation and misinformation that always appear.s does  Plus the topic seems to bring out a lot of aggression in people.\n\n\n\n anonymous_bookseller:\n\nAmazon news reports claim they’ve cracked down on the price gouging. Amazon sellers who open threads to claim otherwise might draw undue controversial attention to the issue. Amazon has solved the problem, no need for discussion.\n\n\nAddressing the problem is not the same as solving it.  Amazon is so huge that there is no way they can simply eliminate price gouging.  I suspect I could do a few simple searches and find examples in minutes.", "\n\n\n RedWing:\n\nAddressing the problem is not the same as solving it.\n\n\nIt was an attempt at satire, hence why the smiley was added to my post.\n\n\n\n anonymous_bookseller:\n\nAmazon has solved the problem, no need for discussion.\n\n", "Sorry, I missed it.  I would suggest  as a sarcasm emoji, lol.", "All I know is I wouldn’t be buying anything from CHINA, Italy or South Korea.  I would also like to mention eventually when the post office closes offices…you will need to find a place to ship your stuff either fedx UPS ,IPS with Doug Hefferenan or somehow besides USPS.  the show must go on.", "\n\n\n HAWKEYE:\n\nIPS with Doug Hefferenan\n\n\nI used them to ship some Penguins to the zoo in Albany. What a mess.", "They are also out of toilet paper which escalates the crisis in our view.", "Sorry to bring this up but I have noticed a backlog of pending orders in my account. Is there any shortage of hands at the fulfillment centers because that is what it looks like with these amount of orders waiting to be fulfilled."], "Likes": "0", "Views": "0"}, "Seller Central “Case Log” Missing?": {"Topic Title": "Seller Central “Case Log” Missing?", "Category": "Selling on Amazon", "Tags": [], "Author": "MyForumUserName", "Commenters": [], "Leading Comment": "Can someone please tell me where I can find my “Case Log” It’s disappeared. Not on main page", "Other Comments": [], "Likes": "0", "Views": "0"}, "How can I create variations under an existing Amazon listing succesfully?": {"Topic Title": "How can I create variations under an existing Amazon listing succesfully?", "Category": "Selling on Amazon", "Tags": ["General Selling Questions"], "Author": "Eco_Home_Life_Style", "Commenters": [], "Leading Comment": "I made a parent (host listing) for an existing listing that I would like to have variations for. When I enter “ASIN” and “SKU” under the “Variations” tab, Amazon finds my existing product, connects it and then I no longer have any variations. How can I create variations under an existing Amazon listing successfully?", "Other Comments": [], "Likes": "0", "Views": "0"}, "How do I sell books overseas for Amazon shipping rates": {"Topic Title": "How do I sell books overseas for Amazon shipping rates", "Category": "Selling on Amazon", "Tags": ["General Selling Questions"], "Author": "Picks_by_Nisha", "Commenters": ["Texas_Exile_Books", "left_coast_books", "Edge_Art"], "Leading Comment": "I do not know of any carriers that will ship even an 11 ounce book to any country overseas (even Mexico) for the Amazon required rate of $16.95. Is there some special category or company that must be used? Most of the time it is over 1 pound so first class is not available and it is does not allow tracking either.", "Other Comments": ["The rate for Mexico is close to that range; note that if you buy shipping through Amazon, you get prices that are better than retail in most cases.\nIf you have the professional plan, you can set your own shipping rates, and even have different rates for different countries (as well as block some countries that are notoriously bad).\nI’m still figuring out details of international shipping, but my cheapest books are not available outside the US; that way, if the shipping charge doesn’t quite cover the cost of postage, I’m still making money (not to mention that that additional hassle isn’t really worth it for a $10 book).\nBut right now, I would recommend turning off international shipping; there are simply too many countries that are not accepting shipments from the US, and even for those that are, both their and the US mail systems are having problems at the moment.", "I discontinued international orders on Amazon this week. While I have a mix of trade paperbacks and the usual octavo hardcovers, the only international orders I have been getting recently were for massive folio art books and book sets. Amazon is inflexible. After multiple years of selling to international customers, I finally decided to pull the plug and negotiate shipping rates with international customers on their affiliate site AbeBooks.", "It’s difficult unless you’re a PRO-SELLER, set your own shipping.\nWe sold internationally for nearly 1/2 our time on AMZ but prices rose steeply and our areas w/ the most sales such as Australia opened AMZ marketplaces.\nCan do without the aggravation-and as @left_coast_books stated, toward the end, international sales dwindled.\nWe don’t miss international sales one whit."], "Likes": "0", "Views": "0"}, "Item Delivered, Signed for.. Customer Claims not received and wants refund… HELP!": {"Topic Title": "Item Delivered, Signed for.. Customer Claims not received and wants refund… HELP!", "Category": "Selling on Amazon", "Tags": ["General Selling Questions"], "Author": "Living_In_a_Van", "Commenters": ["goodseller_2483", "Harbor_Motorsports"], "Leading Comment": "Customer Purchased a car wheel on 05/16/2020. Confirmed order with customer and shipped out item with DSR (Direct Signature Required) FedEx. I purchased shipping through my own FedEx account since it gives me better prices.\nDue to COVID-19, FedEx/UPS implemented the no touch signature, meaning they won’t let the customer touch the pad to sign, but they’ll ask for the name of the person getting the package, type their name and sign COVID. That’s been implemented since 03/2020.\nItem delivered 05/26/2020 at 09:35 am PST. Customer states he work from home and contacted me at 6pm that same day saying package was not delivered and the online signature doesn’t match his. Sent me a copy of license (I did not request it) and stated no package arrived, even though it’s signed for and shows delivered, his first initial and last name. I suggested to file a claim with FedEx for the item cost since package was fully insured and signature is always required on any package(s) I ship.\nFedEx denied the claim stating they confirmed delivery of the item and the driver stated he gave the customer the item. Since then, he requested a refund for the item. I stated I cannot refund for an item that’s been signed for and delivered. Price of the item is $360.\nAdvice?", "Other Comments": ["\n\n\n Harbor_Motorsports:\n\nI stated I cannot refund for an item that’s been signed for and delivered.\n\n\nNothing else to do other than be ready to defend the coming A-Z Claim.", "I don’t understand. Am I suppose to refund the customer his money, even though FedEx investigated and the driver recalls going to the apartment and giving the customer the package? After delivery, he signed the pad with COVID, following the guidelines put in place to keep the required distance.\nFedEx stated they’re waiving the signature requirement from the customer directly due to the pandemic. Do I just start buying shipping via Amazon shipping again to not have to deal with this issue?", "Explain to the customer that they need to request a refund directly from Amazon.\nInform them that the reason needs to be item not received or package not delivered. Provide them this link which will provide step by step instructions on how to do this:\nhttps://www.amazon.com/gp/help/customer/display.html?nodeId=201889740\nOnce the claim is filed represent your side with a timeline that shows sequence of events. Inform amazon that you have followed policy despite the customers lack of receipt. Attached the signature file which proves that you followed policy and request that the claim be funded."], "Likes": "0", "Views": "0"}, "USPS Shipping": {"Topic Title": "USPS Shipping", "Category": "Selling on Amazon", "Tags": [], "Author": "apvvdistribu", "Commenters": ["TwoWave", "norskmedia", "TNValleyProducts", "wheu", "Clicky_Enterprises", "cay", "Jock", "hardingsbooks", "Nikken_Products", "MarciaHDesigns", "GreenFoods", "FunSelling", "ILFS_Inc", "yenobek", "The_Orange_Crush", "Glasgow_s_Goods"], "Leading Comment": "USPS is not working on shipping for me, anyone else having issues?", "Other Comments": ["I noticed that it now has a new checkbox that says, “By clicking Buy Shipping I certify that the contents of the package are covered under U-PIC’s coverage terms”.  What the heck?  I’m not trying to use U-PIC.  Seems we have to click the box to be able to continue now.", "All of sudden U-pic started showing up.\nBy clicking Buy Shipping I certify that the contents of the package are covered under U-PIC’s Coverage Terms. 187\nI have no idea about this,", "Ya I just checked the box and it works now. Odd way to implement a new change to USPS shipping", "Same issue. What is it?", "I guess we all are seeing this.  Just reading through the exclusions and other details.", "Declaring a value raises the price of shipping. If we don’t declare a value will we be reimburse for any items that are lost.", "I don’t understand why we have the check the checkbox when we aren’t declaring any value?  Seems like another Amazon programming oversight.", "Maybe this would cover any lost and missing items if we are not covered by the A-Z INR claims.", "same as me, how to make USPS work?", "\n\n\n GreenFoods:\n\nhow to make USPS work?\n\n\nCheck the UPIC box.", "Godsend. Thanks! At least I have domestic shipping back but exports still don’t work for the last two weeks so I have to wait in line at the post office and pay higher rates. What a waste of time and money, had to raise export shipping prices. Silly amazon, why do they keep changing something that isn’t broke. I know my brother who is a coder is drinking the amazon’s koolaid that whatever glitches happen are intended but I sincerely doubt it. Domestic shipping was glitchy for a few hours last week also until this new deal. Incredible.", "same here for some odd reason", "My USPS shipping not working June 16 2020", "Yes. Saying that the type of tracking selected in shipping preferences is not avail for the choice of shipping made…", "Yes, having the same issue.   Hopefully, the fix is in process.", "It would be nice if Amazon would let sellers know there has been changes made to the shipping platform and what those are so I dont spend 30 minutes thinking their sh!t is broke down again.", "same issue here cant buy any usps shipping today so far.   yet noticed also like others if you check the box it will work,  but what exactly is this box were checking or should we?", "If you do not want to use the U-Pic insurance enter 0 as the amount and then check the box.\nBut for approximately 30-cents for $25.00 worth of insurance coverage, its well worth it.\nIts like Auctiva Insurance on a competitor site - U-Pic covers for non delivery, package loss, external damage, breakage and is a lot less expensive than purchasing insurance from the Post Office (read the limitations - certain items are excluded).\nRemember you are responsible for delivery until the package is physically in your customer’s hands.  If the Post Office marks the package as “delivered” and they claim they did not receive it, you would send them a form (if U-Pic works like Auctiva) which they must fill out and swear under penalty of perjury to the truthfulness of their statement on non receipt.  Once they file it and you file your documentation you are reimbursed (including postage if you declare the cost in total value you purchase).", "Not bad honestly. This may be a good “glitch”. I have been putting 0 to be able to print my labels, but am now contemplating whether to start really using this insurance. Thank you for the info."], "Likes": "0", "Views": "0"}}